#1)#გამოიტანე რიცხვები 1-დან 20-მდე, მაგრამ continue ს გამოყენებით გამოტოვე ყველა ლუწი რიცხვი
for i in range(1,20):
    if i%2==0:
        continue
    print(i)


#2)გამოიტანე რიცხვები 1 დან 45 მდე მაგრამ გამოტოვე ყველა რიცხვი რომელიც იყოფა 3 ზე
for i in range(1,45):
    if i%3==0:
        continue
    print(i)


#3)გამოიიტანე რიცხვები 10 დან 50 მდე მაგრამ გამოტოვე 20, 30  და 40. 
for i in range(1,50):
    if i==20 or i==30 or i==40:
        continue
    print(i)


#4)მომხამარებს შეაყვანინე 5 რიცხვი. თითვეული რიცხვი გამოიტანე მაგრამ თუ რიცხვი უარყოფითი გამოიყენე continue და არ დაბეჭდო.
for i in range(5):
    num=int(input("Enter your num: "))
    if i<0:
        continue
    print(i)


#5)გამოიტანე 1 დან 100 მდე ყველა რიცხვი რომელიც არ იყოფა 5 ზე გამოიყენენ continue ამ რიცხვების გამოსატანად, რომლებიც 5 ზე იყოფა
for i in range(1,100):
    if i%5==1:
        continue
    print(i)

