#1) შექმენი ცვლადი balance = 1000.
#მომხმარებელს შეაყვანინე თანხა.
#თუ თანხა დადებითია, შიგნით შეამოწმე ბალანსზე მეტია თუ არა.
#- თუ არა, დაბეჭდე "თანხა წარმატებით გაიტანეთ"
#- თუ მეტია, დაბეჭდე "არასაკმარისი ბალანსი"
#თუ თანხა 0 ან უარყოფითია, დაბეჭდე "არასწორი თანხა"
balance=1000
cash=int(input("Enter your cash: "))
if cash>0:
    if cash>balance:
        print("თანხა წარმატებით გადაიტანეთ")
    else:
        print("არასაკმარისი ბალანსი")
else:
    print("არასწორი თანხა")


#2) მომხმარებელს შეაყვანინე გამოცდის ქულა.
#თუ ქულა 50 ან მეტია, შიგნით შეამოწმე 90 ან მეტია თუ არა.
#- თუ არის, დაბეჭდე "A"
#- თუ არა, დაბეჭდე "ჩააბარა"
#თუ ქულა 50-ზე ნაკლებია, დაბეჭდე "ჩაიჭრა"
score=int(input("Enter your score: "))
if score>=50:
    if score>=90:
        print("A")
    else:
        print("passed")
else:
    print("failed")


#3) მომხმარებელს შეაყვანინე ტემპერატურა.
#თუ ტემპერატურა 0-ზე მეტია, შიგნით შეამოწმე 30-ზე მეტია თუ არა.
#- თუ არის, დაბეჭდე "ცხელა"
#- თუ არა, დაბეჭდე "თბილა"
#თუ ტემპერატურა 0 ან ნაკლებია, დაბეჭდე "ცივა"
temperature=int(input("Enter your temperature: "))
if temperature>0:
    if temperature>30:
        print("hot")
    else:
        print("warm")
else:
    print("cold")


#4) მომხმარებელს შეაყვანინე წელი.
#თუ წელი 2000-ზე მეტია, შიგნით შეამოწმე ლუწია თუ კენტი.
#- თუ ლუწია, დაბეჭდე "ლუწი წელია"
#- თუ კენტია, დაბეჭდე "კენტი წელია"
#თუ წელი 2000-ზე ნაკლები ან ტოლია, დაბეჭდე "ძველი წელია"
year=int(input("Enter your year: "))
if year>2000:
    if year%2==0:
        print("even year")
    else:
        print("odd year")
else:
    print("old year")


#5) მომხმარებელს შეაყვანინე პროდუქტის რაოდენობა.
#თუ რაოდენობა 0-ზე მეტია, შიგნით შეამოწმე 10-ზე მეტია თუ არა.
#- თუ არის, დაბეჭდე "მარაგი საკმარისია"
#- თუ არა, დაბეჭდე "მარაგი ცოტაა"
#თუ რაოდენობა 0-ია, დაბეჭდე "მარაგი არ არის"
number_of_product=int(input("Enter number of product: "))
if number_of_product>0:
    if number_of_product>10:
        print("supply is enough")
    else:
        print("supply is not enough")
else:
    print("there is no supply")




