#1. მომხმარებელს შემოატანინე რიცხვი.
#თუ რიცხვი დადებითია, დაბეჭდე `"დადებითი რიცხვია"`.
#თუ რიცხვი უარყოფითია, დაბეჭდე `"უარყოფითი რიცხვია"`.
#სხვა შემთხვევაში, დაბეჭდე `"ნულის ტოლია"`.
num=int(input("Enter your number: "))
if num>0:
    print("your num is positive")
elif num<0:
    print("უარყოფითი რიცხვია")
else:
    print("num is zero")


#2. მომხმარებელს შემოატანინე ასაკი.
#თუ ასაკი ნაკლებია 18-ზე, დაბეჭდე `"არასრულწლოვანი"`.
#თუ ასაკი 18-დან 64-მდეა, დაბეჭდე `"ზრდასრული"`.
#სხვა შემთხვევაში, დაბეჭდე `"პენსიონერი"`.
age=int(input("Enter your age: "))
if age<18:
    print("არასრულწლოვანი")
elif age>18 and age<64:
    print("you are adult")
else:
    print("პენსიონერი ხარ")


#3. მომხმარებელს შემოატანინე გამოცდის ქულა.
#თუ ქულა 90-100 შუალედშია, დაბეჭდე `"A"`.
#თუ ქულა 80-89 შუალედშია, დაბეჭდე `"B"`.
#თუ ქულა 70-79 შუალედშია, დაბეჭდე `"C"`.
#თუ ქულა 60-69 შუალედშია, დაბეჭდე `"D"`.
#სხვა შემთხვევაში, დაბეჭდე `"F"`.
score=int(input("Enter your score: "))
if score>90:
    print("Grade A")
elif score>80 and score<89:
    print("Grade B")
elif score>70 and score<79:
    print("C")
elif score>60 and score<69:
    print("D")
else:
    print("Failed")

