#1) გამოიტანე რიცხვები 1-დან 20-მდე, მხოლოდ ლუწები.
for i in range(2,20,2):
    print(i)
#2) გამოიტანე რიცხვები 5-დან 50-მდე, რომლებიც იყოფა 5-ზე.
for i in range(5,50,5):
    print(i)
#3) მომხმარებელს შემოატანინე რიცხვი და for loop-ის გამოყენებით გამოიტანე 1-დან ამ რიცხვამდე ყველა რიცხვი.
n=int(input("Enter your num: "))
for i in range(i,n):
    print(i)
#4) მომხმარებელს შემოატანინე რიცხვი და გამოიტანე მისი გამრავლების ტაბულა 1-დან 10-მდე.
n=int(input("Enter your num: "))
for i in range(1,11):
    print(n*i)
#5) იპოვე რიცხვების 1-დან 100-მდე ჯამი
total=0
for i in range(1,100):
    print(i)
    total+=i
    