#1) მომხმარებელს შეაყვანინე ასაკი.
#თუ ასაკი 18 ან მეტია, შიგნით შეამოწმე არის თუ არა 65-ზე მეტი.
#- თუ არის, დაბეჭდე "პენსიონერი"
#- თუ არა, დაბეჭდე "ზრდასრული"
#სხვა შემთხვევაში დაბეჭდე "არასრულწლოვანი"
age=int(input("Enter your age: "))
if age>=18:
    if age>65:
        print("პენსიონერი")
    else:
        print("ზრდასრული")
else:
    print("არასრულწლოვანი")


#2) მომხმარებელს შეაყვანინე რიცხვი.
#თუ რიცხვი დადებითია, შიგნით შეამოწმე ლუწია თუ კენტი.
#- თუ ლუწია, დაბეჭდე "დადებითი ლუწი"
#- თუ კენტია, დაბეჭდე "დადებითი კენტი"
#სხვა შემთხვევაში დაბეჭდე "რიცხვი არ არის დადებითი"
num=int(input("Enter your number: "))
if num>0:
    if num%2==0:
        print(" დადებითი ლუწი")
    else:
        print("დადებითი კენტი")
else:
    print("რიცხვი არ არის დადებითი")


#3) შექმენი ცვლადი username და password.
#თუ username სწორია, შიგნით შეამოწმე password.
#- თუ password სწორია, დაბეჭდე "შესვლა წარმატებულია"
#- თუ არა, დაბეჭდე "არასწორი პაროლი"
#თუ username არასწორია, დაბეჭდე "მომხმარებელი ვერ მოიძებნა"
username=int(input("Enter your username"))
password=int(input("Enter your password"))
if username=="Giorgi123":
    if password=="python123":
      print("შესვლა წარმატებულია")
    else:
      print("პაროლი არასწორია")
else:
    print("მომხმარებელი არასწორია")



