#1) კომენტარებით ახსენით რას აკეთებს ნაშთიანი გაყოფის ოპერატორი ( % ).
#როდესაც გამოვიყენებთ პროცენტულ გაყოფას,გაყოფისას განაყოფი რიცხვის ნაშთი გამოდის ტერმინალში. 


#2) კომენტარებით ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში Python-ში.
#რიცხვის აყვანა ხარისხში ხდება **-ს საშვალებით


#3) შექმენი ცვლადი, სადაც შეინახავ 6-ის მეორე ხარისხს. შემდეგ დაბეჭდე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი.
box=6**2
print(box)


#4) კომენტარებში დაწერე რას გამოიტანს:
#   - 17 % 5     = 2
#   - 25 % 4     = 1
#   - 30 % 7     = 2


#5) კომენტარებით ახსენით რა არის მონაცემთა ტიპები (Data Types).
#მონაცემთა ტიპი აჩვენებს თუ რა სახის ინფორმაცია ინახება ცვლადში


#6) ჩამოწერე Python-ის ძირითადი მონაცემთა ტიპები.
#bool
#float
#int
#str


#7) თითოეულ მონაცემთა ტიპს კომენტარებით მიუწერე განმარტება.
#str არის ""ში მოტავსებული ტექსტი
#int არის ჩეულებრივი მრგვალი რიცხვები
#float არის ათწილადი რიცხვები ძირითადათ
#bool არის ცვლადი რომლის მნიშვნელობა უნდა იყოს True or False


#8) შექმენი ცვლადი, სადაც შეინახავ შენს სახელს, მეორე ცვლადში შენს ასაკს, ხოლო მესამე ცვლადში იმას, გყავს თუ არა შინაური ცხოველი. შემდეგ დაბეჭდე ყველა ცვლადი.
name = "gio"
age= 14
pet= "dog"
print(name)
print(age)
print(pet)


#9) შექმენი ცვლადი, სადაც შეინახავ შენი მეგობრის სახელს, მეორე ცვლადში მის ასაკს, ხოლო მესამე ცვლადში მის სიმაღლეს. შემდეგ დაბეჭდე ყველა ცვლადი.
name = "data"
age= 14
height= 1.75
print(name)
print(age)
print(height)


#10) შექმენი ორი რიცხვითი ცვლადი. იპოვე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი. თითოეული შედეგი დაბეჭდე.
num1=13
num2=3
print(13+3)
print(13-3)
print(13*3)
print(13/3)
print(13%3)
print(13**3)


#11) შექმენი ცვლადი number, სადაც შეინახავ ნებისმიერ რიცხვს. აიყვანე ის მესამე ხარისხში და დაბეჭდე შედეგი.
num=3
print(num**3)


#12) შექმენი Boolean ტიპის ორი ცვლადი: ერთში შეინახე True, მეორეში False. შემდეგ ორივე დაბეჭდე.
my_name_is_gio= True
I_have_cat=False
print(my_name_is_gio)
print(I_have_cat)


#13) კომენტარებით ახსენით რა განსხვავებაა int-სა და float-ს შორის.

#int მთელი რიცხვია float კი ათწილადია


#14) შექმენი ცვლადი `price`, სადაც შეინახავ პროდუქტის ფასს, და ცვლადი `quantity`, სადაც შეინახავ რაოდენობას. გამოთვალე საერთო ღირებულება და დაბეჭდე.
price=14
quantity= 20
print(price*quantity)


#15) კომენტარებით ახსენით რისთვის გამოიყენება print() ფუნქცია Python-ში

#print ფუნქცია გამოიყენება ინპორმაციის ტერმინალში გამოსატანად